<a href="https://colab.research.google.com/github/cullkid/Data-science-course/blob/main/dataFrame.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
data = {    #  create dictionary data
    'Name': ['Jonh', 'Mike', 'Oly'],
    'Age': [23,42,22],
    'City': ['lisbon', 'faro', 'porto']
}

In [ ]:
data

{'Name': ['Jonh', 'Mike', 'Oly'],
 'Age': [23, 42, 22],
 'City': ['lisbon', 'faro', 'porto']}

In [ ]:
df = pd.DataFrame(data)  # structyring the list data to be in a pandas data-frame form

In [ ]:
df

   Name  Age    City
0  Jonh   23  lisbon
1  Mike   42    faro
2   Oly   22   porto

In [ ]:
listData = [['John', 23, 'lisbon'], ['Mike', 44, 'Cacem'], ['Emmanuel', 33, 'anjos'], ['Janet', 21, 'roma']]  # create list data

In [ ]:
listData

[['John', 23, 'lisbon'],
 ['Mike', 44, 'Cacem'],
 ['Emmanuel', 33, 'anjos'],
 ['Janet', 21, 'roma']]

In [ ]:
dfList = pd.DataFrame(listData, columns=['Name', 'Age', 'City'])   # structyring the list data to be in a pandas data-frame form

In [ ]:
dfList

       Name  Age    City
0      John   23  lisbon
1      Mike   44   Cacem
2  Emmanuel   33   anjos
3     Janet   21    roma

In [ ]:
import numpy as np

In [ ]:
numpyArray = np.array([[1,2,3,4],[5,6,7,8],[9,10,11,12]])  # create numpy array

In [ ]:
numpyArray

array([[ 1,  2,  3,  4],
       [ 5,  6,  7,  8],
       [ 9, 10, 11, 12]])

In [ ]:
numpyArray_dataFrame = pd.DataFrame(numpyArray, columns=['A','B','C','D'])

In [ ]:
numpyArray_dataFrame

   A   B   C   D
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [ ]:
data = {    #  create dictionary data
    'Name': ['Jonh', 'Mike', 'Oly'],
    'Age': [23,42,22],
    'City': ['lisbon', 'faro', 'porto'],
}

In [ ]:
df = pd.DataFrame(data)  # structyring the dictionary data to be in a pandas data-frame form

In [ ]:
df.to_csv('example.csv', index=False)   # the 'example.csv' is the name of the csv file, the 'index=false' is to remove the index of the data

# pay attention to the folder directory whenever you run the code to see the csv file created

In [ ]:
data = pd.read_csv('example.csv')  # this will give us access back to the csv file we created and asign it to the data variable

In [ ]:
data

   Name  Age    City
0  Jonh   23  lisbon
1  Mike   42    faro
2   Oly   22   porto

In [ ]:
df

   Name  Age    City
0  Jonh   23  lisbon
1  Mike   42    faro
2   Oly   22   porto

In [ ]:
df.to_excel('example.xlsx')  # structure this data to excel format

In [ ]:
dataExcel = pd.read_excel('example.xlsx')  # this will give us access back to the xlsx file we created and asign it to the dataExcel variable

In [ ]:
dataExcel

   Unnamed: 0  Name  Age    City
0           0  Jonh   23  lisbon
1           1  Mike   42    faro
2           2   Oly   22   porto

In [ ]:
dataExcel.rename(columns={'City': 'Cities'})  # to rename a column name

   Unnamed: 0  Name  Age  Cities
0           0  Jonh   23  lisbon
1           1  Mike   42    faro
2           2   Oly   22   porto

In [ ]:
df

   Name  Age    City
0  Jonh   23  lisbon
1  Mike   42    faro
2   Oly   22   porto

In [ ]:
dataExcel

   Unnamed: 0  Name  Age    City
0           0  Jonh   23  lisbon
1           1  Mike   42    faro
2           2   Oly   22   porto

In [ ]:
df.head(2)  # give first 2 row

   Name  Age    City
0  Jonh   23  lisbon
1  Mike   42    faro

In [ ]:
df.tail(1)  # give last row

  Name  Age   City
2  Oly   22  porto

In [ ]:
df[['Name']]  # give only the chose column which is 'Name'

# but be careful to not use only one square brack

   Name
0  Jonh
1  Mike
2   Oly

In [ ]:
type(df[['Name']])  # this gives the data type to data-frame

pandas.core.frame.DataFrame

In [ ]:
type(df['Name'])  # while this gives the data type to series

pandas.core.series.Series

In [ ]:
df[['City']].values  # only give the array value of the selected column

array([['lisbon'],
       ['faro'],
       ['porto']], dtype=object)

In [ ]:
df

   Name  Age    City
0  Jonh   23  lisbon
1  Mike   42    faro
2   Oly   22   porto

In [ ]:
df[df['Age'] >= 23]  # this select the row df, where df column 'Age' is greater or equal to 23

   Name  Age    City
0  Jonh   23  lisbon
1  Mike   42    faro

In [ ]:
df[df['Name']  == 'Mike']

   Name  Age  City
1  Mike   42  faro

In [ ]:
df[(df['Name'] == 'Jonh') & (df['City'] == 'lisbon') & (df['Age'] <= 23)]

   Name  Age    City
0  Jonh   23  lisbon

In [ ]:
df

   Name  Age    City
0  Jonh   23  lisbon
1  Mike   42    faro
2   Oly   22   porto

In [ ]:
filterCity = ['lisbon', 'faro']  # asign two city to the new variable filterCity

In [ ]:
df[df['City'].isin(filterCity)]  # select df where df city is inside the filterCity element/value

   Name  Age    City
0  Jonh   23  lisbon
1  Mike   42    faro

In [ ]:
df[df['Name'].str.startswith('O')]  # select df where df Name start with O

  Name  Age   City
2  Oly   22  porto

In [ ]:
np.nan  # use numpy to create a missing values

nan

In [ ]:
data = {
    'A' : [1,2,3,4,5],
    'B' : [6,7,np.nan,9,np.nan],
    'C' : [11,np.nan,13,14,15],
    'D' : [np.nan,17,18,19,20],
    'E' : [21,22,23,24,25]
}

In [ ]:
df=pd.DataFrame(data)

In [ ]:
df

   A    B     C     D   E
0  1  6.0  11.0   NaN  21
1  2  7.0   NaN  17.0  22
2  3  NaN  13.0  18.0  23
3  4  9.0  14.0  19.0  24
4  5  NaN  15.0  20.0  25

In [ ]:
df.isnull()  # checking missing value, if true then it's a missing value

       A      B      C      D      E
0  False  False  False   True  False
1  False  False   True  False  False
2  False   True  False  False  False
3  False  False  False  False  False
4  False   True  False  False  False

In [ ]:
df.isnull().sum()  #  this will count the missing data in each column

A    0
B    2
C    1
D    1
E    0
dtype: int64

In [ ]:
df.dropna()  # this wil temporary drop the rows that contain missing value, but will not drop it from the 'df' variable

   A    B     C     D   E
3  4  9.0  14.0  19.0  24

In [ ]:
df

   A    B     C     D   E
0  1  6.0  11.0   NaN  21
1  2  7.0   NaN  17.0  22
2  3  NaN  13.0  18.0  23
3  4  9.0  14.0  19.0  24
4  5  NaN  15.0  20.0  25

In [ ]:
df.dropna(inplace=True)  # this will drop the rows missing value direct from the 'df' variable

In [ ]:
df

   A    B     C     D   E
3  4  9.0  14.0  19.0  24

In [ ]:
data = {
    'A' : [1,2,3,4,5],
    'B' : [6,7,np.nan,9,np.nan],
    'C' : [11,np.nan,13,14,15],
    'D' : [np.nan,17,18,19,20],
    'E' : [21,22,23,24,25]
}

In [ ]:
df

   A    B     C     D   E
3  4  9.0  14.0  19.0  24

In [ ]:
df = df.dropna()  # another way to drop the rows missing value

In [ ]:
df

   A    B     C     D   E
3  4  9.0  14.0  19.0  24

In [ ]:
data = {
    'A' : [1,2,3,4,5],
    'B' : [6,7,np.nan,9,np.nan],
    'C' : [11,np.nan,13,14,15],
    'D' : [np.nan,17,18,19,20],
    'E' : [21,22,23,24,25]
}
df=pd.DataFrame(data)
df

   A    B     C     D   E
0  1  6.0  11.0   NaN  21
1  2  7.0   NaN  17.0  22
2  3  NaN  13.0  18.0  23
3  4  9.0  14.0  19.0  24
4  5  NaN  15.0  20.0  25

In [ ]:
df.dropna(axis=1)  # will drop all the columns with missing value in the 'df' temporary, note: 'axis=1' is for columns

   A   E
0  1  21
1  2  22
2  3  23
3  4  24
4  5  25

In [ ]:
df.dropna(axis=0)  # will drop all the rows with missing value in the 'df' temporary, note: 'axis=0' is for rows

   A    B     C     D   E
3  4  9.0  14.0  19.0  24

In [ ]:
df

   A    B     C     D   E
0  1  6.0  11.0   NaN  21
1  2  7.0   NaN  17.0  22
2  3  NaN  13.0  18.0  23
3  4  9.0  14.0  19.0  24
4  5  NaN  15.0  20.0  25

In [ ]:
df.dropna(thresh=1)

   A    B     C     D   E
0  1  6.0  11.0   NaN  21
1  2  7.0   NaN  17.0  22
2  3  NaN  13.0  18.0  23
3  4  9.0  14.0  19.0  24
4  5  NaN  15.0  20.0  25

In [ ]:
df

   A    B     C     D   E
0  1  6.0  11.0   NaN  21
1  2  7.0   NaN  17.0  22
2  3  NaN  13.0  18.0  23
3  4  9.0  14.0  19.0  24
4  5  NaN  15.0  20.0  25

In [ ]:
df.fillna(2222)  # this will all the missing value of the data

   A       B       C       D   E
0  1     6.0    11.0  2222.0  21
1  2     7.0  2222.0    17.0  22
2  3  2222.0    13.0    18.0  23
3  4     9.0    14.0    19.0  24
4  5  2222.0    15.0    20.0  25

In [ ]:
df.fillna(df.mean())  # this will fill the missing value with the mean of the column, you can also use meadian, min, max, mode, e.t.c

   A         B      C     D   E
0  1  6.000000  11.00  18.5  21
1  2  7.000000  13.25  17.0  22
2  3  7.333333  13.00  18.0  23
3  4  9.000000  14.00  19.0  24
4  5  7.333333  15.00  20.0  25

In [ ]:
df.fillna(method = 'ffill')  # this fill the missing value by checking the value at the top of the missing value and use it

C:\Users\ezean\AppData\Local\Temp\ipykernel_12620\620692279.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method = 'ffill')  # this fill the missing value by checking the value at the top of the missing value and use it

   A    B     C     D   E
0  1  6.0  11.0   NaN  21
1  2  7.0  11.0  17.0  22
2  3  7.0  13.0  18.0  23
3  4  9.0  14.0  19.0  24
4  5  9.0  15.0  20.0  25

In [ ]:
df

   A    B     C     D   E
0  1  6.0  11.0   NaN  21
1  2  7.0   NaN  17.0  22
2  3  NaN  13.0  18.0  23
3  4  9.0  14.0  19.0  24
4  5  NaN  15.0  20.0  25

In [ ]:
df.fillna(method = 'bfill')  # this fill the missing value by checking the value at the button of the missing value and use it

C:\Users\ezean\AppData\Local\Temp\ipykernel_12620\510900909.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method = 'bfill')  # this fill the missing value by checking the value at the button of the missing value and use it

   A    B     C     D   E
0  1  6.0  11.0  17.0  21
1  2  7.0  13.0  17.0  22
2  3  9.0  13.0  18.0  23
3  4  9.0  14.0  19.0  24
4  5  NaN  15.0  20.0  25

In [ ]:
data = {
    'A': [1,2,3,4,5,6,7,8,9],
    'B': [10,11,12,13,14,15,16,17,18],
    'C': [19,20,21,22,23,24,25,26,27]
}

In [ ]:
locDf= pd.DataFrame(data, index=['a','b','c','d','e','f','g','h','i'])

In [ ]:
locDf

   A   B   C
a  1  10  19
b  2  11  20
c  3  12  21
d  4  13  22
e  5  14  23
f  6  15  24
g  7  16  25
h  8  17  26
i  9  18  27

In [ ]:
locDf.loc['a': 'd']  # this will give only the rows from 'a' to 'd'

   A   B   C
a  1  10  19
b  2  11  20
c  3  12  21
d  4  13  22

In [ ]:
locDf.loc[['a', 'd', 'b']]  # this will give only the rows of 'a'  'd' 'b'

   A   B   C
a  1  10  19
d  4  13  22
b  2  11  20

In [ ]:
locDf.loc[['a', 'b'],['B','C']]  # this will give the 'a', 'b' rows, then 'b', 'c' columns

    B   C
a  10  19
b  11  20

In [ ]:
locDf.iloc[0]  # the iloc select data by it's rows and columns index, this one select the first index

A     1
B    10
C    19
Name: a, dtype: int64

In [ ]:
locDf.iloc[1:4]  # this select the rows index from 1 to 4

   A   B   C
b  2  11  20
c  3  12  21
d  4  13  22

In [ ]:
locDf.iloc[[1,4]]  # this select the rows index of 1 and 4

   A   B   C
b  2  11  20
e  5  14  23

In [ ]:
locDf.iloc[[0,1],[1,2]]  # this select the rows index of 0 and 1, and then column index of 2 and 3

    B   C
a  10  19
b  11  20

In [ ]:
df

   A    B     C     D   E
0  1  6.0  11.0   NaN  21
1  2  7.0   NaN  17.0  22
2  3  NaN  13.0  18.0  23
3  4  9.0  14.0  19.0  24
4  5  NaN  15.0  20.0  25

In [ ]:
data = {    #  create dictionary data
    'Name': ['Jonh', 'Mike', 'Oly'],
    'Age': [23,42,22],
    'City': ['lisbon', 'faro', 'porto']
}
df = pd.DataFrame(data)
df

   Name  Age    City
0  Jonh   23  lisbon
1  Mike   42    faro
2   Oly   22   porto

In [ ]:
# using query() to query the data using sign operators
df.query("Age == 42")

   Name  Age  City
1  Mike   42  faro

In [ ]:
df.query("Age < 22 or Age == 22 & City == 'porto'")

  Name  Age   City
2  Oly   22  porto

In [ ]:
df.query('Age * 2 == 44')

  Name  Age   City
2  Oly   22  porto

In [ ]:
df

   Name  Age    City
0  Jonh   23  lisbon
1  Mike   42    faro
2   Oly   22   porto

In [ ]:
df.sort_values('Age')  # this sort the age into ascending order

   Name  Age    City
2   Oly   22   porto
0  Jonh   23  lisbon
1  Mike   42    faro

In [ ]:
df.sort_values(['Age', 'City'])  # this sort the age into descending order

   Name  Age    City
2   Oly   22   porto
0  Jonh   23  lisbon
1  Mike   42    faro

In [ ]:
df

   Name  Age    City
0  Jonh   23  lisbon
1  Mike   42    faro
2   Oly   22   porto

In [ ]:
df['Age'].rank()

0    2.0
1    3.0
2    1.0
Name: Age, dtype: float64

In [ ]:
df['Age'].rank(method='min')

0    2.0
1    3.0
2    1.0
Name: Age, dtype: float64

In [ ]:
data1 = {
    'A': [1,2,3],
    'B': [4,5,6]
}
data2 = {
    'A': [7,8,9],
    'B': [4,3,2]
}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

df1

   A  B
0  1  4
1  2  5
2  3  6

In [ ]:
df2

   A  B
0  7  4
1  8  3
2  9  2

In [ ]:
pd.concat([df1,df2])  # merging or concatinating data along rows

   A  B
0  1  4
1  2  5
2  3  6
0  7  4
1  8  3
2  9  2

In [ ]:
pd.concat([df1,df2], axis=1)  # merging or concatinating data along columns

   A  B  A  B
0  1  4  7  4
1  2  5  8  3
2  3  6  9  2

In [ ]:
data3 = {
    'A': [1,2,3],
    'B': [11,23,43]
}
df3 = pd.DataFrame(data3)
df3

   A   B
0  1  11
1  2  23
2  3  43

In [ ]:
df1

   A  B
0  1  4
1  2  5
2  3  6

In [ ]:
pd.merge(df1,df3, on='A')   # merging the the 'A' column of df1 and 'A' column of df3 to be one column as they have the same valur

   A  B_x  B_y
0  1    4   11
1  2    5   23
2  3    6   43

In [ ]:
scores = {
    'A': ['John', 'math', 85],
    'B': ['Tobi', 'math' ,80],
    'C': ['James', 'math' ,75],
    'D': ['John', 'English', 95],
    'E': ['Tobi', 'English' ,88],
    'F': ['James', 'English' ,89]
}

In [ ]:
data = {
    'Name' : ['John', 'Mike', 'Zik'],
    'Science': [45,65,67],
    'Maths': [42,85,97]
}

In [ ]:
dataFrame = pd.DataFrame(data)

In [ ]:
dataFrame

   Name  Science  Maths
0  John       45     42
1  Mike       65     85
2   Zik       67     97

In [ ]:
meltDataFrame = pd.melt(dataFrame, id_vars=['Name'], var_name='Subject', value_name='Score')
meltDataFrame

# the melt code reshape the data to more readable way, here the dataFrame dataset is reset/unpivoted to asign each person their scores on each subject individualy

   Name  Subject  Score
0  John  Science     45
1  Mike  Science     65
2   Zik  Science     67
3  John    Maths     42
4  Mike    Maths     85
5   Zik    Maths     97

In [ ]:
meltDataFrame.pivot(index='Name', columns='Subject', values='Score')

# the opposite of melt, the pivote reshape the data and asign scores to the 'Name'

Subject  Maths  Science
Name
John        42       45
Mike        85       65
Zik         97       67

In [ ]:
data = {
    'Date': ['2022-02-01','2022-02-02','2022-02-03'],
    'Sales': [100,400,7689]
        }
df = pd.DataFrame(data)

In [ ]:
df

        Date  Sales
0 2022-02-01    100
1 2022-02-02    400
2 2022-02-03   7689

In [ ]:
df.dtypes

Date     datetime64[ns]
Sales             int64
dtype: object

In [ ]:
df['Date'] = pd.to_datetime(df['Date'])  # this is to change the value 'Date' from string or object to have real time data type

In [ ]:
df.dtypes

Date     datetime64[ns]
Sales             int64
dtype: object

In [ ]:
df['Year'] = df['Date'].dt.year
df['Month'] = df['Date'].dt.month
df['Day'] = df['Date'].dt.day

# The given code extracts the year, month, and day from a datetime column (Date) in a Pandas DataFrame (df) and stores them as new columns (Year, Month, and Day).
# .dt is Used to access datetime-specific properties for a column with date values
# year  Extracts the year from the Date column and stores it in the new Year column.

In [ ]:
df

        Date  Sales  Year  Month  Day
0 2022-02-01    100  2022      2    1
1 2022-02-02    400  2022      2    2
2 2022-02-03   7689  2022      2    3

In [ ]:
dateRang1 = pd.date_range('2020-01-01', periods=5, freq='YE')   # generate dates 5 times by increasing the year
dateRang2 = pd.date_range('2020-01-01', periods=3, freq='ME')   # generate dates 3 times by increasing the month
dateRang3 = pd.date_range('2020-01-01', periods=9, freq='D')   # generate dates 2 times by increasing the day

In [ ]:
dateRang1

DatetimeIndex(['2020-12-31', '2021-12-31', '2022-12-31', '2023-12-31',
               '2024-12-31'],
              dtype='datetime64[ns]', freq='YE-DEC')

In [ ]:
dateRang2

DatetimeIndex(['2020-01-31', '2020-02-29', '2020-03-31'], dtype='datetime64[ns]', freq='ME')

In [ ]:
dateRang3

DatetimeIndex(['2020-01-01', '2020-01-02'], dtype='datetime64[ns]', freq='D')

In [ ]:
dateRang1 = pd.date_range('2020-01-01', periods=5, freq='YE')   # generate dates 5 times by increasing the year
timeSeries = pd.Series([56,76,80,34,65], index=dateRang1)       # create pandas series number and asign in respectfully to dateRange index respectfully

In [ ]:
timeSeries

2020-12-31    56
2021-12-31    76
2022-12-31    80
2023-12-31    34
2024-12-31    65
Freq: YE-DEC, dtype: int64

In [ ]:
dateRange4 = pd.date_range('2020-01-01', periods=9, freq='D')   # generate dates 9 times by increasing the day
timeSeries2 = pd.Series([56,76,80,34,65,6,21,16,13], index=dateRange4)       # create pandas series number and asign in respectfully to dateRange index respectfully

In [ ]:
timeSeries2

2020-01-01    56
2020-01-02    76
2020-01-03    80
2020-01-04    34
2020-01-05    65
2020-01-06     6
2020-01-07    21
2020-01-08    16
2020-01-09    13
Freq: D, dtype: int64

In [ ]:
timeSeries2.resample('ME').sum()    # this will resample the timeSeries wich was by day before to month

#  .sum() will sum all the timeSeries2 data between the month

2020-01-31    367
Freq: ME, dtype: int64

In [ ]:
timeSeries2.resample('ME').mean()

2020-01-31    40.777778
Freq: ME, dtype: float64

In [ ]:
timeSeries2.resample('ME').count()

2020-01-31    9
Freq: ME, dtype: int64

In [ ]:
dateRange4 = pd.date_range('2020-01-01', periods=9, freq='YE')   # generate dates 9 times by increasing the day
timeSeries3 = pd.Series([56,76,80,34,65,6,21,16,13], index=dateRange4)

In [ ]:
timeSeries3

2020-12-31    56
2021-12-31    76
2022-12-31    80
2023-12-31    34
2024-12-31    65
2025-12-31     6
2026-12-31    21
2027-12-31    16
2028-12-31    13
Freq: YE-DEC, dtype: int64

In [ ]:
timeSeries3.resample('D').mean()

2020-12-31    56.0
2021-01-01     NaN
2021-01-02     NaN
2021-01-03     NaN
2021-01-04     NaN
              ...
2028-12-27     NaN
2028-12-28     NaN
2028-12-29     NaN
2028-12-30     NaN
2028-12-31    13.0
Freq: D, Length: 2923, dtype: float64

In [ ]:
timeSeries3.resample('ME').mean()

2020-12-31    56.0
2021-01-31     NaN
2021-02-28     NaN
2021-03-31     NaN
2021-04-30     NaN
              ...
2028-08-31     NaN
2028-09-30     NaN
2028-10-31     NaN
2028-11-30     NaN
2028-12-31    13.0
Freq: ME, Length: 97, dtype: float64

In [ ]:
timeSeries3.resample('ME').min()

2020-12-31    56.0
2021-01-31     NaN
2021-02-28     NaN
2021-03-31     NaN
2021-04-30     NaN
              ...
2028-08-31     NaN
2028-09-30     NaN
2028-10-31     NaN
2028-11-30     NaN
2028-12-31    13.0
Freq: ME, Length: 97, dtype: float64

In [ ]:
timeSeries2.resample('ME').min()

2020-01-31    6
Freq: ME, dtype: int64

In [ ]:
timeSeries2.resample('ME').max()

2020-01-31    80
Freq: ME, dtype: int64

In [ ]:
data = {
    'Date':  ['2020-01-01', '2020-01-02', '2020-01-03'],
    'Sales':[23,45,65]
}
df = pd.DataFrame(data)

In [ ]:
df

         Date  Sales
0  2020-01-01     23
1  2020-01-02     45
2  2020-01-03     65

In [ ]:
df['Data'] = pd.to_datetime(df["Date"])   # this transform the date value to string or object to datetime type

In [ ]:
df

         Date  Sales       Data
0  2020-01-01     23 2020-01-01
1  2020-01-02     45 2020-01-02
2  2020-01-03     65 2020-01-03

In [ ]:
df.set_index('Date', inplace=True)   # set the date coulumns as insex of the dataset

In [ ]:
df

            Sales       Data
Date
2020-01-01     23 2020-01-01
2020-01-02     45 2020-01-02
2020-01-03     65 2020-01-03

In [ ]:
df['Shift-up'] = df['Sales'].shift(1)    # this create a new column in df call 'shift-up' and add the value of zero index on sales column to be the value of 1-index of the new created column and so on
df['Shift-down'] = df['Sales'].shift(-1)    # this is the same but start from the bottom index to the top

In [ ]:
df

            Sales       Data  Shift-up  Shift-down
Date
2020-01-01     23 2020-01-01       NaN        45.0
2020-01-02     45 2020-01-02      23.0        65.0
2020-01-03     65 2020-01-03      45.0         NaN

In [ ]:
data = {
    'Category': ['A','B','C','B','C','B','A','C','A'],
    'Values': [45,67,34,98,3,45,2,90,5]
}
df = pd.DataFrame(data)

In [ ]:
df

  Category  Values
0        A      45
1        B      67
2        C      34
3        B      98
4        C       3
5        B      45
6        A       2
7        C      90
8        A       5

In [ ]:
df.groupby('Category').min()   # to group the category variable by find the median of each through their values

          Values
Category
A              2
B             45
C              3

In [ ]:
df.groupby('Category')['Values'].agg(['sum','min','max','std','var','first','last','prod'])  # same as down one
df.groupby('Category').agg(['sum','min','max','std','var','first','last','prod'])  # same as up one

# .sum()	Returns the sum of values for each group.
# .mean()	Returns the mean (average) value for each group.
# .median()	Returns the median value for each group.
# .count()	Counts the number of non-null values in each group.
# .nunique()	Counts the number of unique values in each group.
# .min()	Returns the minimum value in each group.
# .max()	Returns the maximum value in each group.
# .std()	Returns the standard deviation of values in each group.
# .var()	Returns the variance of values in each group.
# .first()	Returns the first value in each group.
# .last()	Returns the last value in each group.
# .prod()	Returns the product of values in each group.
# .agg()	Allows multiple aggregations at once.
# .apply()	Applies a custom function to each group.

         Values
            sum min max        std          var first last    prod
Category
A            52   2  45  24.006943   576.333333    45    5     450
B           210  45  98  26.627054   709.000000    67   45  295470
C           127   3  90  44.094595  1944.333333    34   90    9180

In [ ]:
customAggregation = lambda a: a.max() - a.min()

df.groupby('Category').agg({'Values': customAggregation})

          Values
Category
A             43
B             53
C             87

In [ ]:
def customAggregation2(Values):
    return sum(Values) / len(Values)

df.groupby('Category')['Values'].agg(customAggregation2)

#  Key Takeaways
#  Use len(Values) if you want to count everything (including missing values).
#  Use count() in Pandas when you want to count only non-null values.

Category
A    17.333333
B    70.000000
C    42.333333
Name: Values, dtype: float64

In [ ]:
data = {
    'A': [2,3,4,5,6],
    'B': [10,20,30,40,50]
}

df = pd.DataFrame(data)
df

   A   B
0  2  10
1  3  20
2  4  30
3  5  40
4  6  50

In [ ]:
useApply = df.apply(lambda x: x*2)  # use apply function and inner function which is lambda to multiply the data by 2

useApply

    A    B
0   4   20
1   6   40
2   8   60
3  10   80
4  12  100

In [ ]:
series = pd.Series([2,3,4,5,6,7])
mapData = series.map(lambda x: x**2)   # use may function to map/loop over all the series data to perform the inner function on each and every one them

mapData

0     4
1     9
2    16
3    25
4    36
5    49
dtype: int64

In [ ]:
df

   A   B
0  2  10
1  3  20
2  4  30
3  5  40
4  6  50

In [ ]:
df['C'] = df.apply(lambda row: row['A'] + row['B'], axis=1)

#  used apply and inner function to create a new column in the dataframe call 'c' with the result of addition of col a and b
#  remember to add axis=1 to allow the code run successfully, meaning answer to be position horizontally

df

   A   B   C
0  2  10  12
1  3  20  23
2  4  30  34
3  5  40  45
4  6  50  56

In [ ]:
arrays = [['A','A','B','B'],[1,2,1,2]]
index = pd.MultiIndex.from_arrays(arrays, names=('Number1','Number2'))
df = pd.DataFrame({'Data': [10,20,30,40]}, index=index)

df

                 Data
Number1 Number2
A       1          10
        2          20
B       1          30
        2          40

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
npArray = np.array([[1,2,3],[4,5,6],[7,8,9]])
df = pd.DataFrame(npArray, columns=['January','February','March'])
df

#  creating numpy arrays and converting it to pandas dataframe

   January  February  March
0        1         2      3
1        4         5      6
2        7         8      9

In [ ]:
data = {'states':['Enugu','Imo','Jigawa','Lagos']}
df = pd.DataFrame(data)

df

   states
0   Enugu
1     Imo
2  Jigawa
3   Lagos

In [ ]:
df['lower'] = df['states'].str.lower()
df['upper'] = df['states'].str.upper()
df['contains'] = df['states'].str.contains('j', case=False)
df['count'] = df['states'].str.count(pat='i')

df

   states   lower   upper  contains  test  count
0   Enugu   enugu   ENUGU     False     0      0
1     Imo     imo     IMO     False     0      0
2  Jigawa  jigawa  JIGAWA      True     1      1
3   Lagos   lagos   LAGOS     False     0      0